[
  {
    "master_project_id": "100001",
    "project_name": "ISEKAI Memories",
    "category": "UNITY",
    "date": "2020",
    "url": "https://ten-sura-m.bn-ent.net/en/",
    "description": "<strong>SLIME - ISEKAI MEMORIES</strong> is an immersive turn-based RPG that takes inspiration from the beloved anime 'That Time I Got Reincarnated as a Slime.' With its captivating gameplay, stunning anime graphics, and a rich story based on the popular anime, the game offers an enchanting adventure in a fantastical world.\\n\\n<strong>MY ROLE</strong> : As a senior developer, my role in SLIME - ISEKAI Memories was instrumental in bringing the game to life. I took on the responsibility of designing key game systems, implementing crucial features, and optimizing performance to ensure a seamless and immersive player experience.\\n\\n<strong>TECHNOLOGY</strong> : Unity 2020.3f LTS, UniTask for asynchronous programming, C# 8.0, Restful API integration, FlatBuffer serialization, and dependency injection enabled by Zenject",
    "sort_order": "1"
  },
  {
    "master_project_id": "100002",
    "project_name": "Heaven Burns Red",
    "category": "UNITY",
    "date": "2021",
    "url": "https://heaven-burns-red.com/",
    "description": "<strong>HEAVEN BURNS RED</strong> is a compelling turn-based RPG that delivers an immersive and memorable gaming experience. The game features the exceptional talent of renowned music composer and writer Jun Maeda. With its visually striking art style and intricately crafted story, Heaven Burns Red takes players on a captivating journey through a vibrant and immersive world.\\n\\n<strong>MY ROLE</strong> : In my role as a senior developer on the project, I played a crucial part in the development of Heaven Burns Red. With my expertise and experience, I contributed significantly to the implementation of key features and optimizations. Additionally, I took the initiative to develop tools that empowered the game designers, enabling them to efficiently create and fine-tune game content. This included writing tools to streamline the integration of assets, ensuring a smooth workflow and enhancing the overall efficiency of the development process.\\n\\n<strong>TECHNOLOGY</strong> : Unity 2018.3f LTS, UniTask for asynchronous programming, C# 8.0, Restful API integration, FlatBuffer serialization, and dependency injection enabled by Zenject",
    "sort_order": "1"
  },
  {
    "master_project_id": "100003",
    "project_name": "Adventure Time Heroes",
    "category": "UNITY",
    "date": "2019",
    "url": "https://play.google.com/store/apps/details?id=net.gogame.galaxy&hl=en",
    "description": "\"<strong>ADVENTURE TIME HEROES</strong> is an exciting game inspired by the popular cartoon series \"Adventure Time.\" Embark on an epic adventure in the Land of Ooo, where you'll join your favorite characters on thrilling quests and face off against formidable foes. Immerse yourself in the colorful and whimsical world of Adventure Time as you explore captivating environments, unravel intriguing storylines, and engage in strategic battles.\\n\\n<strong>MY ROLE :</strong>As a senior game developer on the project, I played a pivotal role in bringing Adventure Time Heroes to life. I took charge of producing prototypes for gameplay ideas and features, ensuring that each aspect of the game was thoroughly tested and refined. Additionally, I developed tools to empower the game designers, allowing them to create and fine-tune game content with ease. Another essential aspect of my role was optimizing game performance to deliver a smooth and enjoyable gaming experience.\\n\\n<strong>TECHNOLOGY</strong> Unity 2020.3f LTS, UniTask for asynchronous programming, C# 8.0, Restful API integration, TCP socket communication, FlatBuffer serialization, and dependency injection enabled by Zenject\"",
    "sort_order": "1"
  },
  {
    "master_project_id": "100004",
    "project_name": "Billionaire PLUS",
    "category": "UNITY",
    "date": "2021",
    "url": "N/A",
    "description": "<strong>BILLIONAIRE PLUS</strong> takes the traditional famous board game Monopoly and elevates it to new heights, delivering an immersive and engaging gaming experience. With a unique twist, players are equipped with special skills based on their chosen character and level, injecting a fresh sense of excitement and strategy into the gameplay. Alongside its captivating gameplay mechanics, Billionaire PLUS also incorporates idle elements to further captivate and sustain player interest.\\n\\n<strong>MY ROLE</strong>: As a member of the development team, my role was instrumental in bringing Billionaire PLUS to life. I took charge of creating prototypes to explore and refine gameplay ideas, ensuring a solid foundation for the game. Implementing key features and mechanics, I worked diligently to enhance the overall gameplay experience. Additionally, I developed tools to streamline the workflow for the game design team and collaborated closely with the art team to ensure a seamless and high-quality game delivery.\\n\\n<strong>TECHNOLOGY</strong>: Billionaire PLUS incorporates Unity 2020.3f LTS, UniTask for asynchronous programming, C# 8.0, TCP socket programming, Protobuf serialization, and unit testing utilizing the Unity Test Framework.",
    "sort_order": "1"
  },
  {
    "master_project_id": "100005",
    "project_name": "Horse Of Legend",
    "category": "UNITY",
    "date": "2022",
    "url": "N/A",
    "description": "\"<strong>HORSE OF LEGEND</strong> is an engaging game that invites players to immerse themselves in the world of magnificent horses. Players will have the exciting task of managing and training these majestic creatures, preparing them for thrilling races. Experience the thrill of equestrian pursuits as you navigate through training sessions and aim to achieve victory on the race track.\\n\\n<strong>MY ROLE</strong>: As a senior game developer, my role in the project encompassed creating prototypes, developing tools for game designers, optimizing game performance, and implementing various automation tools to streamline development processes.<strong>TECHNOLOGY</strong>: incorporates Unity 2020.3f LTS",
    "sort_order": " UniTask for asynchronous programming"
  },
  {
    "master_project_id": "100006",
    "project_name": "Thanh Hoa",
    "category": "UNITY",
    "date": "2018",
    "url": "N/A",
    "description": "<strong>THANH HOA</strong> is an enticing single-player game, currently in the early stages of development, that draws inspiration from the captivating mythology of Vietnam. Immerse yourself in the heroic tale of Thanh Giong as you embark on a quest to defeat menacing monsters and restore peace to the village.\\n\\n<strong>MY ROLE</strong>: As a key contributor to the project, my role involved engaging in detailed discussions about the game concepts, shaping the overall game concept and storyline. I worked diligently to translate the design ideas into functional game code, bringing the captivating world of Thanh Hoa to life. Stay tuned as Thanh Hoa evolves and takes shape.\\n\\n<strong>TECHNOLOGY:</strong> Thanh Hoa harnesses Unity 2020.3f and utilizes the Dragon-bone animation system for captivating character animations.",
    "sort_order": "1"
  },
  {
    "master_project_id": "100007",
    "project_name": "Brick crushing",
    "category": "UNITY",
    "date": "2020",
    "url": "N/A",
    "description": "<strong>BRICK CRUSHING</strong> is an addictive hyper casual game that offers a delightful twist on the classic brick-breaking concept. With engaging gameplay and a simple art style, players use a ball to break through a series of bricks\\n\\n<strong>MY ROLE<strong/>: translating the design ideas into a functional game code.\\n\\n<strong>TECHNOLOGY<strong>: Unity2018.3 LTS",
    "sort_order": "4"
  },
  {
    "master_project_id": "100008",
    "project_name": "Quiz Runner",
    "category": "UNITY",
    "date": "2020",
    "url": "N/A",
    "description": "<strong>QUIZ RUNNER</strong> is an exciting 3D hyper-casual game that challenges players to race to the goal by listing every possible answer to the given question. With its lowpoly funny art style, the game provides a visually entertaining experience that keeps players engaged.\\n\\n<strong>MY ROLE</strong>: translating the design ideas into a functional game code.\\n\\n<strong>TECHNOLOGY<strong>: Unity2018.3 LTS",
    "sort_order": "4"
  },
  {
    "master_project_id": "100009",
    "project_name": "Fashion Holic",
    "category": "HTML5",
    "date": "2019",
    "url": "https://play.ludigames.com/game.html?pID=4094&gameName=Fashion%2520Holic",
    "description": "<strong>FASHION HOLIC</strong> is an engaging HTML5 2D casual game that puts your fashion eye to the test. Step into the world of modeling and help the girl become famous by creating stunning fashion looks. Players must carefully choose the right outfits, accessories, and hairstyles to make a lasting impression.\\n\\n<strong>MY ROLE</strong>: I collaborated closely with the design team and art team, ensuring seamless communication to bring the game to life.\\n\\n<strong>TECHNOLOGY</strong>: Cocos Creator 3.0",
    "sort_order": "5"
  },
  {
    "master_project_id": "100010",
    "project_name": "Paper Flight",
    "category": "HTML5",
    "date": "2019",
    "url": "https://play.ludigames.com/game.html?cat=Ludi+Original&pID=3536&gameName=Paper%2520Flight",
    "description": "<strong>PAPER FLIGHT</strong> is an HTML5 game game where you control a paper plane through challenging obstacles with just one tap.\\n\\n<strong>MY ROLE</strong>: As a game developer, I translated design ideas into functional game code\\n\\n<strong>TECHNOLOGY</strong>: Cocos Creator 3.0",
    "sort_order": "5"
  },
  {
    "master_project_id": "100011",
    "project_name": "Urban Stack",
    "category": "HTML5",
    "date": "2019",
    "url": "https://play.ludigames.com/game.html?cat=Ludi+Original&pID=3802&gameName=Urban%2520Stack",
    "description": "<strong>URBAN STACK</strong> is an fun HTML5 game that challenges players to build towering skyscrapers with a simple tap. As blocks of buildings descend, players must strategically stack them on top of each other to create the highest skyscraper possible.\\n\\n<strong>MY ROLE</strong>: As a game developer, I translated design ideas into functional game code\\n\\n<strong>TECHNOLOGY</strong>: Cocos Creator 3.0",
    "sort_order": "5"
  },
  {
    "master_project_id": "100012",
    "project_name": "Tasty Drop",
    "category": "HTML5",
    "date": "2019",
    "url": "https://play.ludigames.com/game.html?pID=4229&gameName=Tasty%2520Drop",
    "description": "<strong>TASTY DROP</strong> is a delightful mobile game that puts your coordination skills to the test with its simple one-tap gameplay. Your mission is to catch falling eggs and skillfully place them into bowls to serve your loyal customers.\\n\\n<strong>MY ROLE</strong>: As a game developer, I translated design ideas into functional game code\\n\\n<strong>TECHNOLOGY</strong>: Cocos Creator 3.0",
    "sort_order": "5"
  },
  {
    "master_project_id": "100013",
    "project_name": "Dead Rivals",
    "category": "CPP",
    "date": "2017",
    "url": "https://www.gameloft.com/dead-rivals/",
    "description": "<strong>DEAD RIVALS</strong> is an immersive MMORPG that thrusts players into a post-apocalyptic world infested with zombies. As a survivor, you must navigate through the desolate landscapes and fend off hordes of the undead. With three unique main characters, each equipped with distinct abilities, you'll embark on a thrilling journey where survival is the ultimate goal.\\n\\n<strong>MY ROLE</strong>: porting the game from iOS to Android and Windows Phone platforms, ensuring a seamless gaming experience across different devices, I also handled the conversion of shader code from GLSL to HLSL, or vice versa, to ensure optimal performance and visual quality. Additionally, I integrated third-party tools and libraries to enhance the game's functionality and deliver a polished user experience\\n\\n<strong>TECHNOLOGY</strong>: in-house game engine built with C++",
    "sort_order": "3"
  },
  {
    "master_project_id": "100014",
    "project_name": "Modern Combat Versus",
    "category": "CPP",
    "date": "2018",
    "url": "https://www.moderncombatversus.com/",
    "description": "<strong>Modern Combat Versus</strong> is an exciting first-person shooter game that thrusts players into intense multiplayer battles. With its stunning graphics, immersive gameplay, and adrenaline-pumping action, it offers a thrilling experience for FPS enthusiasts.\\n\\n<strong>MY ROLE</strong>: As a developer, I played a crucial role in the porting process of Modern Combat Versus from iOS to Android and Windows Phone platforms, expanding the game's reach to a broader audience. Additionally, I focused on resolving shader code bugs and performing the intricate task of porting them from GLSL to HLSL. Moreover, I successfully integrated a range of third-party tools and libraries, enriching the game's functionality and ensuring a remarkable gaming experience for players.\\n\\n<strong>TECHNOLOGY</strong>: in-house game engine built with C++",
    "sort_order": "3"
  },
  {
    "master_project_id": "100015",
    "project_name": "Contra",
    "category": "PERSONAL",
    "date": "2017",
    "url": "N/A",
    "description": "<strong>Contra</strong> is classic side-scrolling shooting gameplay, that has been given a fun twist.\\n\\n<strong>MY ROLE</strong>: I took on the exciting challenge of recreating the beloved classic game Contra entirely from scratch by building a 2D game engine based on DirectX. I had the opportunity to handle various aspects of game development, including input handling, physics simulation, and collision detection,etc. By building these fundamental functionalities from the ground up, I honed my game development skills and gained a deep understanding of the inner workings of game engines. This project allowed me to showcase my technical expertise and passion for game development while paying homage to a timeless gaming experience.\\n\\n<strong>TECHNOLOGY</strong>: C++, DirectX11",
    "sort_order": "3"
  },
  {
    "master_project_id": "100016",
    "project_name": "Viper",
    "category": "UNITY",
    "date": "2021",
    "url": "N/A",
    "description": "<strong>VIPER</strong> is a thrilling multiplayer snake game that offers a variety of game modes and a wide selection of skins to customize your snake\\n\\n<strong>MY ROLE</strong>: As a developer, my role was to bring the game design to life\\n\\n<strong>TECHNOLOGY</strong>: Built using Unity 2020.3f LTS and leveraging the capabilities of C# 8, Asynchronous programming with UniTask, TCP/UDP socket programming enables real-time communication between players, Flatbuffer serialization optimizes data transmission and storage efficiency.",
    "sort_order": "2"
  },
  {
    "master_project_id": "100017",
    "project_name": "Unity Visual Effect",
    "category": "PERSONAL",
    "date": "2022",
    "url": "N/A",
    "description": "<strong>UNITY VFX</strong> is a small-scale project that showcases my knowledge for Shader Graph, HLSL, and scriptable rendering features",
    "sort_order": "2"
  }
]